package com.illyasr.mydempviews.ui.activity.guaxiang;

import android.widget.TextView;

import com.illyasr.mydempviews.base.BasePresenter;

import java.util.HashMap;
import java.util.Map;

/**
 * TODO
 *
 * @author qingshilin
 * @version 1.0
 * @date 2022/5/12 19:14
 */
public class DivinationPresent extends BasePresenter {
    public Map<String, Divination> divMaps = new HashMap<>();

    public Map<String, Divination> getDivMaps() {
        return divMaps;
    }

    public void init() {
        divMaps.put("111111", new Divination("乾卦。 困龙得水",
                "【乾】者，健也。刚健不曲中正，困龙得水，困渊中不得舒展，忽然天降大雨，得雷鸣而起，任意飞腾，时来运转之兆。",
                "曰：无不欢乐，上人见喜，祸不成凶，诸事顺利。","断：刚健中正，久处逆境，马上有用，吉事上升。"));
        divMaps.put("111110", new Divination("姤卦。 他乡遇友",
                "【姤】者，遇也，不期而遇，行人久困在外，举目无亲，偶然遇友相亲相爱，甚是得意，时来运转，困穷他乡志不伸，忧愁寂寞到如今，时来喜逢遇知音，面对相谈大放心。",
                "曰：他乡遇友喜气欢，须知运气福禄添，自今开始顺利运，往后凶厄不相干。","断：交易有成，官事有理，走失可寻，出门见喜。"));
        divMaps.put("111100", new Divination("遁卦。 浓云蔽日",
                "【遁】者，避也。退避不出，有浓云蔽日之象，失势云蔽日，如同太阳中午时节，天下照，忽然来了一块浓云遮蔽了光，诸事不遂。",
                "曰：浓云遮日不见明，劝君且莫出远行，婚姻求财皆不顺，提防是非到门前。","断：月令不善，走失难见，交易合伙，诸事平淡。"));
        divMaps.put("111000", new Divination("否卦。 虎落深坑",
                "【否】者，塞也。闭塞不通。如猛虎落深坑，有一只老虎下山寻食，不料被人掘下一深坑，虎下去了，总有威风不能伸展，凶多吉少。",
                "曰：猎人掘下一深坑，一只老虎要入坑 ，若不提防掉下去，保管你凶多吉少。","断：走失难寻，交易不定，婚姻不美，不可轻动。"));
        divMaps.put("110000", new Divination("风地观卦。 旱荷得水",
                "【观】者，为人所仰也，故有旱荷得水之象。一池荷花，正当天旱的时候，池干花枯，全不茂盛，忽然天降大雨，花又茂盛，占此卦者，得贵人扶助之兆。",
                "象：事业荷花出水中，旱日不如往日同，幸得逢水来相灌，枝叶重鲜花更红。","断：此卦有水来浇荷，生意买卖利息多，婚姻自有人来助，出门永不受折磨。走失得见口舌散，疾病皆除人人善。"));
        divMaps.put("100000", new Divination("山地剥卦。 莺鹊同林",
                "【剥】者，落也，阴升阳落，故有莺鹊同林之象，如同有一小鹊，天晚枝宿大林之中，不想有莺在内，莺见鹊即生恶意，占此卦者，主小人暗算，干事无成之兆也。",
                "象：鹊遇天晚入林中，不想内里先有莺，莺见小鹊生恶意，口舌是非不见轻。","断：莺鹊同林不相合，占的此卦琐碎多，恩人无义反为怨，是非平地起风波。"));
        divMaps.put("101000", new Divination("火地晋卦。 锄地得金",
                "【晋】者，进也。前进后益，故有锄地得金之象，乃一农人锄地抱垄，甚是辛苦，一日锄地锄出金子来，时来运转之兆也。",
                "象：农人地里示锄草，谁知财金将人找，一锄锄出金子来，这个运气也算好。","断：锄地得金卦如何，占者逢之喜气多，谋事谋财皆如意，婚姻有成疾病消。口舌消散见官有理，行人即至，出门见喜。"));
        divMaps.put("101111", new Divination("火天大有卦。 砍树摸雀",
                "【大有】者，所有大也。故有砍树摸雀之兆，乃是一人偶见树上有一窝雀鸟，有心上去摸之，恐其晃悠，遂将此树砍倒，稳拿的。占此卦者，做事稳当之兆。",
                "象：此卦占之好处多，砍倒大树摸老雀，稳稳当当拿到手，别人空看摸不着。","断：砍树摸雀做事牢，是非口舌自然消，婚姻合伙不费力，若问走失未逃脱，恍忽事不做，拿稳才下手，任你求各利，到处自然有。"));
        divMaps.put("010010", new Divination("坎为水卦。 水底捞月",
                "【坎】者，陷也。劳而无功，故有水底捞月之象。水井内乃有一轮明月照入水中，甚是真切，来了一人，下水去捞，占得此卦，受劳而无功之兆。",
                "象：一轮明 月照水中，只见影子不见踪，愚人当财下去捞，摸来摸去一场空。","断：水中明月不可捞，占此逢之运不高，交易出行难获利，走失行人无音耗。求名不遂，疾病未愈，婚姻无成，合伙不利。"));
        divMaps.put("010011", new Divination("水泽节卦。 斩将封神",
                "【节】者，有限而止也。故有斩将封神之象。姜太公灭纣王后，一切鬼魂尽赴台前，俱各受神得位，占此卦者，百无禁忌之兆。",
                "象：时来运转姜太公，登台封神喜气生，到此诸神皆退位，总然有祸不成凶。","断：太公封神不非凡，谋求钱财不费难，交易合伙大吉庆，疾病口舌消除安。月令高强，名声大扬，走失有信，官事无妨。"));
        divMaps.put("010001", new Divination("水雷屯卦。 乱丝无头",
                "【屯】者，物始生而未遇也。故有乱丝无头之象。乃一机户在室外落丝，忽然狂风大作，将丝刮乱，左撕右扯找不出头来，占此卦者，颠倒错乱之象。",
                "象：风刮乱丝不见头，逢着 闲事暂切推，慢从缓来方可顺。","断：交易求财无好处，谋事见贵心不遂，疾病难好，婚姻不巧，口舌琐碎，凡事打绞。"));
        divMaps.put("010101", new Divination("水火既济卦。 金榜题名",
                "【既济】者，既成之事也。",
                "象：金榜以上题姓名，不负当年窗下功，人逢此卦多吉应，一切谋望大亨通。","断：金榜题名喜气新，求财到手利婚姻，如今交了顺当运，步步登高大遂心。月令即善，寻人得见，走失能找，口舌消散。"));
        divMaps.put("011101", new Divination("泽火革卦。 旱苗得雨",
                "【革】者，变革也。凶变为吉，故有旱苗得雨之象。春苗久旱，夏天无雨，苗枯，幸得油然作云，沛然作雨苗则勃然而生，占此卦者，时来运转。",
                "象：旱苗得雨茂堂堂，交易求财也相当，婚姻合伙皆如意，官司疾病皆无妨。","断：苗逢旱天渐渐衰，幸得天恩降雨来，忧去喜来能变化，谋望求财遂心怀。出门大喜，走失能找，行人来信，百般凑巧。"));
        divMaps.put("001101", new Divination("雷火丰卦。 古镜重明",
                "【丰】者，大也，以明而动，故有古镜重明之象，似一多年古镜，日久不甚光明，忽然遇一匠人磨明，又极光明，占此卦者，时来运转之兆。",
                "象：古镜昏暗好多年，一朝磨的似月圆，君子谋事逢此卦，时来运转喜自然。","断：古镜重明甚光显，主人目下运气转，婚姻求财多吉庆，走失行人去不远，出行有益，交易得魁，疾病见好，求名必遂。"));
        divMaps.put("000101", new Divination("地火明夷卦。 过河拆桥",
                "【明夷】者伤也，明而见伤。故有过河拆桥之象，如同与人修桥渡河，不想人先过去，将桥拆掉，不能前进，占的此卦，主临事难为，多有不顺之兆。",
                "象：时乘运拙忙修桥，急忙过河拆了桥，恩人无义反为怨，凡事无功主受劳。","断：过河拆桥事堪伤，交易出行有灾殃，谋望求财空费力，婚姻合伙不相当。行人未至，头绪不准，口舌要避，凡事不稳。"));
        divMaps.put("000010", new Divination("地水师卦。 马到成功",
                "【师】者，其众也，战无不克也。故有马到成功之象。如同一位将军，奉命征伐贼寇，闯进营去，大获全胜。占此卦，诸事成功之兆。",
                "象：将军奉旨去出征，骑着大马拉硬弓，百步穿扬射得准，箭落金钱喜气生。","断：马到成功喜气生，求名取利大吉昌，婚姻合伙无妨碍，交易出行也顺当。疾病大好，走失能找，行人来信，事事凑巧。"));
        divMaps.put("100100", new Divination("艮为山卦。 矮巴钩枣",
                "【艮】者，止也，止于极而不进也。故有矮巴钩枣之象。矮巴人，心想吃枣，走在树下，不料树高人矮，干着急，钩不着。占此卦者，主事干着急不顺。",
                "象：财帛常在心中走，可恨眼前难到手，不如暂时且忍耐，逢着闲事休开口。","断：矮巴钩枣难捞着，交易行人不投机，谋望求财空费力，婚姻合伙总是虚。行人未至，头绪不真，口舌躲避，凡事留心。"));
        divMaps.put("100101", new Divination("山火贲卦。 喜气盈门",
                "【贲】者，饰也，物之有饰，故有喜气盈门之象。",
                "象：时来运转瑞气周，美德淑女君子求，钟鼓乐之大吉庆，占之逢之喜临头。","断：卦逢吉神在运中，纵是有凶不为凶，婚姻合伙渐渐好，生意财源日日增。出行吉祥，百事无妨，失物得见，月令高强。"));
        divMaps.put("100111", new Divination("山天大畜卦。 阵势得开",
                "【大畜】者，所畜之聚，故有阵势得开之象。",
                "象：忧愁常琐两眉头，千头万绪挂心留，从此以后打开阵，任意而行无阻挡。","断：此卦占之带六合，疾病口舌渐渐磨，婚姻合伙皆如意，谋望求财无差错。交了好运，行人有信，出门大吉，百事和顺。"));
        divMaps.put("100011", new Divination("山泽损卦。 推车掉耳",
                "【损】者，减也，损内益外，如同车夫推车下坡，不料下到中间掉下耳来，左右安插不上，主占的此卦，事费力之兆也。",
                "象：推车掉耳路难行，心中打算力不能，君子占此琐碎卦，纵然无灾也困穷。","断：时运不及费心多，比作推车受折磨，山路崎岖掉下耳，左插右按不着边。时运不及，不要胡为，交节换月，自然顺妥。"));
        divMaps.put("101011", new Divination("火泽睽卦。 贩猪卖羊",
                "【睽】者，乖异也，性相违弃。",
                "象：贩猪卖羊运不遂，如同太公做买卖，贩猪羊快转头迟，猪羊同贩不让宰。","断：贩卖猪羊运不遂，卦见此人不见回，交易出行无好处，婚姻求财且莫为，名不利，利不全，病不好，做事难。"));
        divMaps.put("111011", new Divination("天泽履卦。 凤鸣岐山",
                "【履】者，蹑也，有所蹑而未进也，故有凤鸣岐山之象。",
                "象：凤凰落在西岐山，鸣了三声出圣贤，天降文王开基业，富贵荣华八百年。","断：凤落岐山闯四方，占之逢之大吉昌，走失行人有音信，生意合伙入时多。出行有益，求财必准，疾病皆除，谋事平稳。"));
        divMaps.put("110011", new Divination("风泽中孚卦。 俊鸟出笼",
                "【孚】者，信也，信而中正应呼天，故有俊鸟出笼之象。",
                "象：俊鸟幸得出笼中，脱了灾难显威风，直上青云福立至，东南西北任意行。","断：俊鸟乘机出笼中，月光灾难大逃通，寻人费力逃难好，官司疾病皆无凶，合伙如意，迁移如心，买卖兴旺，求财得意。"));
        divMaps.put("110100", new Divination("风山渐卦。 行走薄冰",
                "【渐】者，进也。故有行走薄冰之象。如同一人过河无桥，冰上行走，不想走到中间，其冰甚薄，心中着实惊恐，占此卦，凡事当缓，做事不可急迫之兆。",
                "象：路上行人在隆冬，过河无桥走薄冰，小心谨慎过得去，一步错了落水中。","断：行人走冰怕冰薄，交易出行要琢磨，婚姻合伙休大意，官司口舌需要和。薄冰甚是险，行人却男尽，君子占此卦，凡事要小心。"));
        divMaps.put("001001", new Divination("震为雷卦。 金钟夜撞",
                "【 震】者，动也，震惊百里，故有金钟夜撞之象。一棵金钟埋没多时，忽然一日冲出，重新高挂，于夜间敲钟一下，声音响亮，占此卦者，诸事有成之兆。",
                "象：一棵金钟在淤泥，人人拿它当顽石，忽然日钟高悬起，响亮一声天下知。","断：占者逢这撞金钟，时来运转响一声，谋望求财不费力，交易出行大有功。求名趁意，做事遂心，走失行人，自然有音。"));
        divMaps.put("001000", new Divination("雷地豫卦。 青龙得位",
                "【 豫】者，乐和也。人心乐和，故有青龙得位之象。",
                "象：太公插下杏黄旗，收妖为徒而归歧，自此青龙得了位，一切谋望百事顺。","断：青龙得水喜重生，谋望求财事有成，婚姻出行无阻碍。是非口舌得安宁。交易有成，行人即归，收取可得，合伙无妨。"));
        divMaps.put("001010", new Divination("雷水解卦。 五关脱难",
                "【解】者，难散也。遇难即解，故有五关脱难之象。",
                "象：目下月令如过关，千辛万苦受煎熬，时来临相有人救，任意所为能过关。","断：五关脱难运抬头，劝君应当把财求，交易出行有人助，疾病口舌不须愁。婚姻大好，行人来的早，谋望成全，诸事凑巧。"));
        divMaps.put("001110", new Divination("雷风恒卦。 鱼来撞网",
                "【恒】者，久也。故有鱼来撞网之象。",
                "象：渔翁寻鱼运气好，鱼来撞网跑不了，别人使劲侯不来，谁知一到就凑巧。","断：鱼来撞网乐自然，卦占行人很快还，交易出行两成全，谋望成事不费难。出行凑巧，有病即好，虽然口舌，自然消了。"));
        divMaps.put("000110", new Divination("地风升卦。 指日高升",
                "【升】者，进也，似乎升阶，故有指日高升之象。",
                "象：士人来占必得名，生意买卖也兴隆，匠艺之人交易好，庄农逢之好收成。","断：指日高升气象新，走失行人有音信，巧名出行遂心好，疾病口舌皆除根。求财到手，谋望有成，寻人得见，家宅安宁。"));
        divMaps.put("010110", new Divination("水风井卦。 枯井生泉",
                "【井】者，穴通也。水从井出。故有枯井生泉之象。",
                "象：枯井废了好多年，一朝泉出流水鲜，滋生万物人称美，时来运转乐自然。","断：枯井生泉富禄加，名声喜气大光华，以前虽昌驳杂日，望后自然有发达。精神渐爽，富禄日增，出入皆吉，白事亨通。"));
        divMaps.put("011110", new Divination("泽风大过卦。 夜梦金钱",
                "【大过】者，祸也。二阴不胜其重，故有夜梦金钱之象。",
                "象：夜梦金钱醒来空，醒来总是一文无，目下只是求本分，思念只是空劳神。","断：夜梦金银醒来空，求名求利大不通，婚姻难成交易散，走失行人不见踪。月令不和，做事无着，凡事忍耐，休去琢磨。"));
        divMaps.put("011001", new Divination("泽雷随卦。 推车靠涯",
                "【随】者，顺也。能顺物，故有推车靠涯之象。",
                "象：泥里步踏这几年，推车靠涯在眼前，目下就该再用力，扒上涯去财源发。","断：推车靠涯道路干，谋望求财不费难，婚姻合伙无阻碍，疾病口舌得安然。苦极生荣，喜气盈盈，一切做事，不大离形。"));
        divMaps.put("000000", new Divination("坤为地卦。 饿虎得食",
                "【坤】者，顺也。内外纯阴共柔顺，故有饿虎得食之象。",
                "象：肥羊一群入山冈，饿虎喜之把口张，适物充饥肠心欢，卦逢坤顺大吉昌。","断：饿虎得食喜气欢，求名应试主高迁，出门吉利行人到，是非口舌不相干。寻人得见，走失有信，疾病见好，凡事皆顺。"));
        divMaps.put("000001", new Divination("地雷覆卦。 夫妻反目",
                "【覆】者，反也。反复不定。故有夫妻反目之象。",
                "象：马氏太公不相合，进入家庭犹疑多，因人无义反为怨，是非平地起风波。","断：夫妻反目不顺情，卦占谋望未有成，官司惊恐财帛散，若问家宅不安宁。目下不吉，心事不足，交节换月，自然安宁。"));
        divMaps.put("000011", new Divination("地泽临卦。 发政施仁",
                "【临】者上临下也，坤居兑上似临民之意。故有发政施仁之象。",
                "象：君王无道民倒悬，常想拨云见晴天，幸逢明主施仁政，重又安居乐自然。","断：发政施仁志量高，出外求财任逍遥，交易婚姻大有意，走失行人有音消。口舌消散，疾病见痊，求名如意，家宅平安。"));
        divMaps.put("000111", new Divination("地天泰卦。 捷报三喜",
                "【泰】者，通泰也。诸事通泰，故有喜报三元之象。",
                "象：学问满腹入科场，三元及第得意回，从此解去愁和闷，且喜平地一声雷。","断：喜报三元运气强，谋望求财大吉祥，交易出行多得意，是非口舌皆无妨。婚姻有成，行人及至，走失可寻，诸事趁意。"));
        divMaps.put("001111", new Divination("雷天大壮卦。 工师得木",
                "【大壮】者，盛也。事得兴隆，故有共师得木之象。",
                "象：卦占工师得大木，眼前应在路上走，时来运转多顺当，有事尽管放心做。","断：买卖求财大亨通，婚姻合伙皆如意，一切谋望皆成功。出门吉利，口舌远避，疾病皆除，行人即至。"));
        divMaps.put("011111", new Divination("泽天乖卦。 游蜂脱网",
                "【乖】者，决也。刚健而悦，故有游蜂脱网之象。",
                "象：入蜘蛛网似天牢，粘住游蜂翅翎毛，幸得大风吹破网，脱离灾难又逍遥。","断：游蜂脱网喜无边，添财进口富禄连，外财通达内财顺，富贵荣华胜 以前，词讼了结，疾病除根，求财到手，做事遂心。"));
        divMaps.put("010111", new Divination("水天需卦。 明珠出海",
                "【需】者，须也，得时而动，故有明珠出海之象。",
                "象：明珠土埋日久深，无光无亮到如今，忽然大风吹土去，自然显露又重新。","断：土里显出明珠来，口舌官司消散开，走失行人当见面，交易有成没有灾。谋望有成，婚姻交合，求财如意，挪动喜也。"));
        divMaps.put("010000", new Divination("水地比卦。 船得顺风",
                "【比】者，辅也，相辅佐之意，故有船得顺风之象。",
                "象：顺风行船柱起蓬，上天又助一阵风，不用费力逍遥去，任意而行走西东。","断：船得顺风不可停，欲向何方任意新刚，交易求财大得利，一切谋望事有成。走失可寻，见官有理，婚姻求名，管保恭喜。"));
        divMaps.put("101101", new Divination("离为火卦。 天官赐福",
                "【离】者，光明也，阴丽乎阳，故有天官赐福之象。",
                "象：官长来占主高升，庄农人家富禄增，生意买卖利也厚，匠人艺人大运通。","断：来人占卦遇天官，必然富禄降人间，一切谋望皆吉庆，忧愁消散主平安，月令皆善，诸事亨通，出门见喜，灾消病散。"));
        divMaps.put("101100", new Divination("火山旅卦。 宿鸟焚巢",
                "【旅】者，半羁旅也。不得舒展，故有宿鸟焚巢之象。",
                "象：飞鸟树上驿高巢，小人用计把巢烧，君占自卦为不吉，一切谋望枉徒劳。","断：宿鸟焚巢时运低，交易任你走东西，生意买卖皆不利，官司口舌被人欺。出行费力，行人来还，走失无认，求财也难。"));
        divMaps.put("101110", new Divination("火风鼎卦。 渔人得利",
                "【鼎】者，烹饪之物，烹以养贤，故有渔人得利之象。",
                "象：莺弄蛤蜊落沙滩，蛤蜊弄莺两翅扇，鱼翁进前双利，走失行人即日还。","断：鱼翁得利喜自然，谋望求财两周全，婚姻合伙双得利，卦者适值喜气添。出门有利，交易可成，官司无妨，生意兴隆。"));
        divMaps.put("101010", new Divination("火水未济卦。 太岁月建",
                "【未济】者，事未成也，火水不交。故有太岁月建之象。",
                "象：凡事需要多小心，提防偷营动寨人，卦逢太岁多凶杀，时加谨慎祸不轻。","断：太岁入运事多愁，婚姻财帛莫强求，交易出行未见好，走失行人不露头，官讼不昌，口舌灾殃，目下忍耐，过月无妨。"));
        divMaps.put("100010", new Divination("山水蒙卦。 小鬼偷钱",
                "【蒙】者，味也，常味不明，故有小人偷钱之象。",
                "象：卦中爻象犯小耗，君子占之运不高，婚姻合伙有琐碎，做事必然受苦劳。","断：占之此卦犯小耗，谋望求财空过桥，婚姻合伙有人破，交易出行受煎熬，为人多仗义，挣钱不费力，有心学仔细，倒被鬼偷去。"));
        divMaps.put("110010", new Divination("风水涣卦。 隔河望金",
                "【涣】者，散也，散而不聚。故有隔河望金之象。",
                "象：隔河望见一锭金，欲取河宽水又深，指望资财难到手，昼夜思想枉费心。","断：财帛隔着一条河，岸宽水深摸不着，过月才能广吉应，目下不必来琢磨。婚姻不吉，合伙不利，交易出行，总不如意。"));
        divMaps.put("111010", new Divination("天水讼卦。 二人争路",
                "【讼】者，辩也，事有争取，故有二人争路之象。",
                "象：心中有事实难做，好象两人来争路，目下局势都争先，谁肯让谁走一步。","断：两人争路未肯降，占之逢之费主张，交易出行有阻碍，生意合伙也平常。目下不吉，休争闲气，好事难成，求财费力。"));
        divMaps.put("111101", new Divination("天火同人卦。 仙人指路",
                "【同人】者，与人同也，同心同德，故有仙人指路之象。",
                "象：心中有事不开怀，一切事情犯疑猜，幸遇明人来指路，诸般忧愁自消裁。","断：仙人指路大运通，劝君任意走西东，交易求财不费力，婚姻合伙有响应。婚姻有成，行人归家，走失可见，做事无差。"));
        divMaps.put("011011", new Divination("兑为泽卦。 趁水和泥",
                "【兑】者，悦也，临事而悦。故有趁水和泥之象。",
                "象：这个卦象真有趣，做事觉的不费力，休要错过这机会，事事觉得随心意。","断：趁水和泥泥更匀，头向有准宜出门，交易婚姻大有意，走失行人不用寻。口舌消散，病遇良医，求财到手，大吉大利。"));
        divMaps.put("011010", new Divination("泽水困卦。 挪梯抽杆",
                "【困】者，穷困也，而不能自振。故有挪梯抽杆之象。",
                "象：时运不来好伤怀，二人商议来摸雀，打梯用杆没到手，不想梯杆有人挪，上去了就是下不来。","断：今有小人暗来欺，千方百计商量你，明明前来说好话，挪梯抽杆失主意。当交君子，莫交小人，凡事小心，谨慎从事，不受贫困。"));
        divMaps.put("011000", new Divination("泽地萃。 鲤鱼变龙",
                "【萃】者，升聚也，万物萃聚，故有鲤鱼变龙之象。",
                "象：游鱼戏水被网惊，跳过龙门身化龙，三尺杨柳垂金线，万朵桃花显你能。","断：鲤鱼化龙喜气来，口舌疾病身无灾，犹疑从今都消散，祸门闭来福门开。鲤鱼化龙，喜事重重，求财到手，做事有成。"));
        divMaps.put("011100", new Divination("泽山咸卦。 萌芽出土",
                "【咸】者，交感也，天地感而万物生，故有萌芽出土之象。",
                "象：过去黄金失色，时来运转临月令，该咱出头已无差，喜气洋洋心放宽。从前滚来滚去，今日又把芽发，往后财源滚滚，纵有口舌不用怕。","断：脚踏实地转悠悠，时运不来莫强求，幸得今日时运转，自有好事在后头。谋望有成，出门可行，走失有信，疾病安宁。"));
        divMaps.put("010100", new Divination("水山赛卦。 雨雪满途",
                "【赛】者，难也，足不能前进，行走艰困，故有雨雪满途之象。",
                "象：大雨洒地雪漫天，路上行人艰又难，拖泥带水费尽力，事不遂心且耐烦。","断：雨雪满途甚行踪，交易出行路不通，疾病难治婚难成，谋望求财真难办。行人未至，头向不稳，官司缠身，求名不准。"));
        divMaps.put("000100", new Divination("地山谦卦。 二人分金",
                "【谦】者，谦让也，有功不居，故有二人分金之象。",
                "象：天赐穷人一堆金，不争不抢两平分，彼此分得金到手，一切谋望皆遂心。","断：二人分金喜气多，谋望吉庆求财和，口舌消散疾病少，走失行人归家窝。婚姻如意，出行得地，交易合伙，无不吉利。"));
        divMaps.put("001100", new Divination("雷山小过卦。 急过小桥",
                "【小过】者，阳也，阳过于阴，故有急过小桥之象。",
                "象：行人路过独木桥，心中恍惚眼力瞧，爽快保你能过去，慢走一步不牢靠。","断：独木桥上步难行，主人心事不安宁，交易合伙宜爽快，婚姻有成莫迟疑。求财到手，官事平常，目下有害，交节自强。"));
        divMaps.put("001011", new Divination("雷泽归妹卦。 缘木求鱼",
                "【归妹】者，少女从长男，阴阳不交，故有缘木求鱼之象。",
                "象：求鱼须得水中求，树上求之万不通，受尽辛苦难遂意，劳而无功运平平。","断：缘木求鱼事多难，虽不得鱼后无灾，行险弄巧费尽心，事不遂意妄安排。月令不好，做事颠倒，打算的多，遂心的少。"));
        divMaps.put("110110", new Divination("巽为风卦。 孤舟得水",
                "【巽】者，顺也，巽顺而入，故有孤舟得水之象。",
                "象：一只孤舟落沙滩，有船无水时运难，时逢大雨江河满，不用费力任往返。","断：孤舟得水出沙滩，出外行人把家还，是非口舌皆无碍，婚姻合伙多周全。功名称意，求财得利，交易可成，疾病痊愈。"));
        divMaps.put("110111", new Divination("风天小畜卦。 密云不雨",
                "【小畜】者，以以阴畜阳也，有气无质，故有密云不雨之象。",
                "象：苗逢旱天尽焦稍，谁想云浓雨不浇。农民仰天长叹气，事从虚来莫心高。","断：浓云密排下雨难，盼望行人不见还，交易出行空费力，婚姻求财是枉然。月令中平，暂且从容，疾病口舌，交节安宁。"));
        divMaps.put("110101", new Divination("风火家人卦。 镜里观花",
                "【家人】者，一家之人也。内外各失其真，故有镜里观花之象。",
                "象：一朵鲜花镜中开，看似极好取不来，劝君不可镜花爱，凡事不可巧安排。","断：镜里观花休认真，谋望求财不遂心，交易慢成婚姻合，走失行人无信音。出行不好，疾病未愈，求名无难，谋事不宜。"));
        divMaps.put("110001", new Divination("风雷益卦。 枯木开花",
                "【益】者，增益也，有益无损，故有枯木开花之象。",
                "象：时来运转吉气发，多年枯木又开花，枝叶重发多茂盛，几人见了几人夸。","断：枯木开花渐渐荣，主人事业大兴隆，婚姻求财大吉庆，口舌疾病得安宁。交易有成，见官得理，走失可寻，出门见喜。"));
        divMaps.put("111001", new Divination("无雷无妄卦。 鸟囚牢笼",
                "【无妄】者，无所期望也。故有鸟囚牢笼之象。",
                "象：飞鸟失机落笼中，纵然想飞不能行。目下只宜守本份，妄想扒高万不能。","断：鸟被牢笼难出头，占者逢之失自由，谋望求财难定准，疾病口舌怨忧愁。出门不遇，合伙无利，婚姻走失，疾病不愈。"));
        divMaps.put("101001", new Divination("火雷噬嗑卦。 饥人遇食",
                "【噬嗑】者，齿也、合也，故有饥人遇食之象。",
                "象：运拙如同身受饥，有人面前送饭衣，适口充腹心欢喜，忧愁从此渐消移。","断：饥人遇食喜事来，凡事称心巧安排，疾病口舌消除散，生意合伙大发财。见官有理，出门见喜，婚姻成全，诸事如意。"));
        divMaps.put("100001", new Divination("山雷颐卦。 渭水访贤",
                "【颐】者，养也，口食物以自养，故有渭水访贤之象。",
                "象：太公独钓渭水河，手执丝杆忧愁多。时来又遇文王访，自此永不受折磨。","断：文王访贤在渭河，谋望求财皆遂心，交易出行方如意，疾病口舌皆离身。渭水访贤，大吉大利。占着此卦，好了运气。"));
        divMaps.put("100110", new Divination("山风蛊卦。 推磨贪道",
                "【蛊】者，坏也。极而有此事，故有推磨贪道之象。",
                "象：卦中爻象如推磨。顺当为福反为祸，心中有益且迟缓，几事尽从忙里错。","断：推磨贪道运不济，疾病口舌范忧愁，婚姻合伙心改变，走失不定在哪里。出行无益，婚姻不遂，走失难见，诸事难为。"));
    }

    public void showResult(String msg, TextView t1,TextView t2,TextView t3,TextView t4) {
        Map<String, Divination> map = getDivMaps();
        Divination bean = map.get(msg);
        t1.setText(bean.getDivName());
        t2.setText(bean.getDivTag());
        t3.setText(bean.getDivEle());
        t4.setText(bean.getDivPle());
    }

}
